tests/load-tests/test3/load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60  
      arrivalRate: 10  
    - duration: 120
      arrivalRate: 50
scenarios:
  - flow:
      - post:
          url: "/auth/login"
          json:
            username: "test"
            password: "test"
      - get:
          url: "/events/statistics"
      - post:
          url: "/events/add"
          json:
            sessionId: "12345"
            page: "homepage"
            actionType: "click"
            data: {}
      - post:
          url: "/events/add"
          json:
            sessionId: "12345"
            page: "homepage"
            actionType: "visit"
            data: {}